{
  "id": "content_is_data",
  "schema": [
    "substance-article",
    "0.1.0"
  ],
  "nodes": {
    "document": {
      "type": "document",
      "id": "document",
      "views": [
        "content",
        "figures",
        "info"
      ],
      "guid": "content_is_data",
      "creator": "",
      "title": "Content as Data: Towards Open Digital Publishing with Substance",
      "abstract": "",
      "published_on": "2013-10-08T15:13:28.242Z",
      "meta": {}
    },
    "content": {
      "type": "view",
      "id": "content",
      "nodes": [
        "cover",
        "text_1",
        "header_1",
        "header_2",
        "text_2",
        "header_3",
        "text_3",
        "header_4",
        "text_4",
        "header_5",
        "text_5",
        "header_6",
        "text_6",
        "header_7",
        "text_7",
        "header_8",
        "text_8",
        "header_9",
        "text_9",
        "header_10",
        "text_10",
        "header_11",
        "text_11",
        "header_12",
        "text_12",
        "header_13",
        "text_13",
        "text_14",
        "header_14",
        "text_15",
        "header_15",
        "text_16",
        "header_16",
        "text_17",
        "header_17",
        "text_18",
        "header_18",
        "text_19",
        "text_20",
        "text_21",
        "text_22"
      ]
    },
    "text_1": {
      "type": "text",
      "id": "text_1",
      "source_id": null,
      "content": "I’m the maintainer of Substance, an open software platform for collaborative composition and sharing of digital documents. In this little essay, I’d like to sketch the challenges that modern publishing systems face today. I’d also like to come up with ideas for how the complexity can be handled with the help of specialized user-driven software. With Substance, our team is implementing the proposed ideas, not only to verify their feasability but also to release a crowd-funded open source publishing system as a modern alternative to existing publishing solutions."
    },
    "header_1": {
      "type": "heading",
      "id": "header_1",
      "source_id": "challenges-of-modern-digital-publishing",
      "content": "Challenges of modern digital publishing",
      "level": 1
    },
    "header_2": {
      "type": "heading",
      "id": "header_2",
      "source_id": "content-creation",
      "content": "Content Creation",
      "level": 2
    },
    "text_2": {
      "type": "text",
      "id": "text_2",
      "source_id": null,
      "content": "In the beginning there is content creation. Text needs to be written, annotated and structured. Images, tables and lists need to be added. Today, the addition of interactive content (such as visualizations, interactive maps, etc.) is becoming increasingly important and should be supported by publishing systems."
    },
    "header_3": {
      "type": "heading",
      "id": "header_3",
      "source_id": "quality-management",
      "content": "Quality Management",
      "level": 2
    },
    "text_3": {
      "type": "text",
      "id": "text_3",
      "source_id": null,
      "content": "In order to ensure quality and consistency of digital content, publishers need to setup a peer-review workflow. Publishing systems must provide means for reviewers to suggest ideas and report errors, and should offer easy communication between reviewers and authors."
    },
    "header_4": {
      "type": "heading",
      "id": "header_4",
      "source_id": "publishing",
      "content": "Publishing",
      "level": 2
    },
    "text_4": {
      "type": "text",
      "id": "text_4",
      "source_id": null,
      "content": "Once the content is complete, it’s time to share it with the public. Publishing used to be a manual process involving expert knowledge and consuming a substantial amount of time, but software tools have now automatized it. Authors should be able to share their work online themselves, without any manual steps being necessary."
    },
    "header_5": {
      "type": "heading",
      "id": "header_5",
      "source_id": "change-management",
      "content": "Change Management",
      "level": 2
    },
    "text_5": {
      "type": "text",
      "id": "text_5",
      "source_id": null,
      "content": "Even if the best review processes were applied, all published content is prone to inconsistencies and errors. Over time, pieces of content need to be updated, additional information added, and new editions of the document published to ensure eventual consistency. Therefore publishing systems must support incremental updates, and offer an easy way to release new editions."
    },
    "header_6": {
      "type": "heading",
      "id": "header_6",
      "source_id": "content-distribution",
      "content": "Content distribution",
      "level": 2
    },
    "text_6": {
      "type": "text",
      "id": "text_6",
      "source_id": null,
      "content": "Content distribution is becoming an increasingly complex issue today. Back in the day there was just paper, but today content is also consumed electronically on different platforms: on the web, Ebook Readers and Smartphones. And they are all different. There needs to be a smart mechanism that automagically turns one publication into a variety of formats (ePub, HTML, PDF) so as a publisher, you don’t have to prepare versions for each and every targeted platform."
    },
    "header_7": {
      "type": "heading",
      "id": "header_7",
      "source_id": "solutions",
      "content": "Solutions",
      "level": 1
    },
    "text_7": {
      "type": "text",
      "id": "text_7",
      "source_id": null,
      "content": "Over the last 2 years we have done a lot of research, and built a working prototype, Substance. Here are some of our conclusions about what makes a good digital publishing system."
    },
    "header_8": {
      "type": "heading",
      "id": "header_8",
      "source_id": "separate-content-from-presentation",
      "content": "Separate content from presentation",
      "level": 2
    },
    "text_8": {
      "type": "text",
      "id": "text_8",
      "source_id": null,
      "content": "Many traditional publishing systems store rich markup (such as HTML) and thus only allow publishing in that same format, which is a serious limitation when it comes to multi-platform publishing. How would you turn an HTML document into a printable version? How would you optimize it for Ebook Readers that use special document formats (e.g. Amazon Kindle)? By storing content (plain text) and annotations separately, it becomes possible for users to transform their documents into any format."
    },
    "header_9": {
      "type": "heading",
      "id": "header_9",
      "source_id": "structured-composition",
      "content": "Structured Composition",
      "level": 2
    },
    "text_9": {
      "type": "text",
      "id": "text_9",
      "source_id": null,
      "content": "By considering a document as a sequence of content elements rather than one big chunk of formatted text, document editors can provide a better way of writing semantically structured content, as opposed to the visually optimized layouts offered by traditional word-processors."
    },
    "header_10": {
      "type": "heading",
      "id": "header_10",
      "source_id": "offline-editing",
      "content": "Offline Editing",
      "level": 2
    },
    "text_10": {
      "type": "text",
      "id": "text_10",
      "source_id": null,
      "content": "We’ve seen the drawbacks of fully web-based publishing solutions, such as high latency and data loss. It turned out that providing an offline editor can significantly improve the user experience during editing and guarantee data security. Importantly information will stay private until users synchronize their publication with a public web-server. Moreover, authors can continue editing even if there’s no internet connection."
    },
    "header_11": {
      "type": "heading",
      "id": "header_11",
      "source_id": "support-for-collaboration",
      "content": "Support for Collaboration",
      "level": 2
    },
    "text_11": {
      "type": "text",
      "id": "text_11",
      "source_id": null,
      "content": "Authoring a publication is an iterative process that may involve many authors simultaneously editing a single document. During that process users should be enabled to add markers and comments to certain text fragments. Markers and comments should stay out of the user’s way, and only be shown contextually (e.g. when the text cursor is matching the corresponding marker)."
    },
    "header_12": {
      "type": "heading",
      "id": "header_12",
      "source_id": "extensibility",
      "content": "Extensibility",
      "level": 2
    },
    "text_12": {
      "type": "text",
      "id": "text_12",
      "source_id": null,
      "content": "Editing requirements are fundamentally different among application domains. While book authors are comfortable with headings, text and images, scientists may demand more advanced content types such as formulas, data-tables and visualizations to prove their research findings. Publishing systems should feature a simple plugin system in order to allow user-specific content types."
    },
    "header_13": {
      "type": "heading",
      "id": "header_13",
      "source_id": "substance",
      "content": "Substance",
      "level": 1
    },
    "text_13": {
      "type": "text",
      "id": "text_13",
      "source_id": null,
      "content": "Substance is a content creation tool and a simple multi-format publishing platform. Whether you produce stories, books, documentations or scientific papers, Substance provides the tools that allow you to create, manage and share your content. It is being built with the idea of Open Knowledge in mind. So if you’d like to publish, comment on and collaborate around public documents, open access research or public domain texts, Substance may be for you."
    },
    "text_14": {
      "type": "text",
      "id": "text_14",
      "source_id": null,
      "content": "The Substance eco-system consists of an offline editing tool (The Substance Composer) and an online multi-platform publishing system (Substance.io)."
    },
    "header_14": {
      "type": "heading",
      "id": "header_14",
      "source_id": "open-source",
      "content": "Open Source",
      "level": 2
    },
    "text_15": {
      "type": "text",
      "id": "text_15",
      "source_id": null,
      "content": "Behind the scenes Substance is mainly composed by a stack of open source modules that are publicly released under the Open Source MIT license, so anyone can contribute and help developing an open standard for annotated text. Substance is meant to be an interoperable platform, rather than a product. Its infrastructure can be used by anyone to build specialized applications on top of it."
    },
    "header_15": {
      "type": "heading",
      "id": "header_15",
      "source_id": "content-is-data",
      "content": "Content is data",
      "level": 2
    },
    "text_16": {
      "type": "text",
      "id": "text_16",
      "source_id": null,
      "content": "Substance considers content as data, which makes them accessible to computers and allows new ways of processing them. Documents can not only be viewed, they can be queried, just like a database."
    },
    "header_16": {
      "type": "heading",
      "id": "header_16",
      "source_id": "semantic-editing",
      "content": "Semantic editing",
      "level": 2
    },
    "text_17": {
      "type": "text",
      "id": "text_17",
      "source_id": null,
      "content": "Instead of editing a big canvas, Substance documents are composed of content elements. While existing solutions (like Google Docs) bring traditional word-processing to the web, Substance focuses on content, by leaving the layout part to the system, not the user. Because of the absence of formatting utilities, it suggests structured content-oriented writing."
    },
    "header_17": {
      "type": "heading",
      "id": "header_17",
      "source_id": "custom-element-types",
      "content": "Custom Element Types",
      "level": 2
    },
    "text_18": {
      "type": "text",
      "id": "text_18",
      "source_id": null,
      "content": "Substance comes with a predefined set of element types. Out of the box you can choose from headings, text and images. However, it is easy to implement your own element types, and use it with your tailored version of the Substance Composer."
    },
    "header_18": {
      "type": "heading",
      "id": "header_18",
      "source_id": "substance-needs-your-help",
      "content": "Substance needs your help!",
      "level": 1
    },
    "text_19": {
      "type": "text",
      "id": "text_19",
      "source_id": null,
      "content": "After a two-year experimental phase, our next goal is getting it ready for production. So we sat down, worked out a roadmap and launched a campaign to back development costs."
    },
    "text_20": {
      "type": "text",
      "id": "text_20",
      "source_id": null,
      "content": "http://pledgie.com/campaigns/18902"
    },
    "text_21": {
      "type": "text",
      "id": "text_21",
      "source_id": null,
      "content": "With the help of your donation we could make it happen, which is exciting! If you like the ideas proposed and want to see them in action, please support us."
    },
    "text_22": {
      "type": "text",
      "id": "text_22",
      "source_id": null,
      "content": "This post was originally published on the Open Knowledge Foundation Blog."
    },
    "link_1": {
      "type": "link",
      "id": "link_1",
      "path": [
        "text_20",
        "content"
      ],
      "range": [
        0,
        34
      ],
      "url": "http://pledgie.com/campaigns/18902"
    },
    "link_2": {
      "type": "link",
      "id": "link_2",
      "path": [
        "text_22",
        "content"
      ],
      "range": [
        42,
        72
      ],
      "url": "http://blog.okfn.org/2013/01/15/content-as-data-towards-open-digital-publishing-with-substance/"
    },
    "figures": {
      "type": "view",
      "id": "figures",
      "nodes": []
    },
    "info": {
      "type": "view",
      "id": "info",
      "nodes": [
        "collaborator_1"
      ]
    },
    "collaborator_1": {
      "type": "collaborator",
      "id": "collaborator_1",
      "source_id": "",
      "name": "Michael Aufreiter",
      "role": "author",
      "organization": "",
      "image": "michael.png",
      "email": "ma@zive.at",
      "contribution": ""
    },
    "collaborator_reference_1": {
      "type": "person_reference",
      "id": "collaborator_reference_1",
      "path": [
        "cover",
        "authors",
        "1"
      ],
      "range": [
        0,
        17
      ],
      "target": "collaborator_1"
    },
    "cover": {
      "type": "cover",
      "id": "cover",
      "source_id": "",
      "authors": [
        "collaborator_reference_1"
      ],
      "image": ""
    }
  }
}